% vim: set fenc=utf8 syntax=prolog :
:-	module('6.09', []).
:-	encoding(utf8).

%-----------------------------------------------------------------------------------------------------------------------------


t(
	result('C_од (коэффициент, что допускается принималь согласно данной таблице для применения в формуле 6.28)'(C_од, 'д.е.?')),
	baseline_data([
		'угол внутреннего трения или угол сдвига'(X_ψ, 'град')
	])
):-
	functions:lic(0.00, 15.0, X_ψ, 0.000, 0.045, C_од);
	functions:lic(15.0, 20.0, X_ψ, 0.045, 0.067, C_од);
	functions:lic(20.0, 25.0, X_ψ, 0.067, 0.092, C_од);
	functions:lic(25.0, 30.0, X_ψ, 0.092, 0.121, C_од);
	functions:lic(30.0, 35.0, X_ψ, 0.121, 0.158, C_од);
	functions:lic(35.0, 40.0, X_ψ, 0.158, 0.202, C_од).
