% vim: set fenc=utf8 syntax=prolog :
:-	module('6.11', []).
:-	encoding(utf8).

%-----------------------------------------------------------------------------------------------------------------------------

t(R, BD):-
	R = result('η (коэффициент согласно таблицы №6.11)'(Кη, 'д.е.')),
	BD = baseline_data([
		'объемный вес грунта засыпки'(V_γ_н_з, 'тс/м^3'),
		GP
	]),
	(
		(
			GP = 'грунт'(['наименование'('песчаный'), 'вид'(V), 'степень влажности'(_)]),
				( V ='гравелистый'; V = 'крупный'; V = 'средней_крупности'; V = 'мелкий' ),
			functions:li(1.55, 1.7, V_γ_н_з, 0.5, 0.8, Кη)
		);
		(
			GP = 'грунт'(['наименование'('песчаный'), 'вид'(V), 'степень влажности'('влажный')]),
			V = 'пылеватый',
			functions:li(1.55, 1.7, V_γ_н_з, 0.5, 0.8, Кη_bad), Кη is Кη_bad - Кη_bad * 0.15
		);
		(
			GP = 'грунт'(['наименование'('песчаный'), 'вид'(_), 'степень влажности'('насыщенный водой')])
		);
		(
			GP = 'грунт'(['наименование'('глинистый'), 'вид'(V), 'J_L (консистенция)'(J_L, 'д.е.')]),
			(
				J_L =< 0.5, functions:li(1.55, 1.7, V_γ_н_з, 0.4, 0.6, Кη);
				(
					( (	V = 'глина'; V = 'суглинок' ),	J_L > 0.5, J_L =< 0.75 ); 
					(	V = 'супесь', 			J_L > 0.5, J_L =< 1.00 )
				), functions:li(1.55, 1.7, V_γ_н_з, 0.4, 0.6, Кη_bad), Кη is Кη_bad - Кη_bad * 0.15
			)
		)
	).
