% vim: set fenc=utf8 syntax=logtalk :
:-	module( foundations, []).
:-	encoding(utf8).
'параметр'('тип'(T), P):-
	( T = 'Ф1-А'; T = 'Ф2-А'; T = 'Ф3-А'; T = 'Ф4-А'; T = 'Ф5-А'; T = 'Ф6-А'; T = 'ФП5-А'; T = 'ФС1-А'; T = 'ФС2-А' ),
	P = 'диаметр болтов оголовка'(42, 'мм');

	( T = 'Ф1-А'; T = 'Ф2-А'; T = 'Ф3-А'; T = 'Ф4-А'; T = 'Ф5-А'; T = 'Ф6-А'; T = 'ФП5-А'; T = 'ФС1-А'; T = 'ФС2-А' ),
	P = 'база болтов оголовка'(250, 'мм');

	( T = 'Ф1-А'; T = 'Ф2-А'; T = 'Ф3-А'; T = 'Ф4-А'; T = 'Ф5-А'; T = 'Ф6-А'; T = 'ФП5-А'; T = 'ФС1-А'; T = 'ФС2-А' ),
	P = 'глубина заложения'(3.0, 'м');

	( T = 'Ф1-А'; T = 'Ф2-А'; T = 'Ф3-А'; T = 'Ф4-А'; T = 'Ф5-А'; T = 'Ф6-А'; T = 'ФП5-А'; T = 'ФС1-А'; T = 'ФС2-А' ),
	P = 'геометрический размер сечения колонны'(400, 'мм');
	%----------------------------------------------------------------------------------------------------------------------------------------
	(
		( T = 'Ф1-А'; T = 'Ф2-А' ),
		P = 'высота'(3.2, 'м');
		( T = 'Ф3-А'; T = 'Ф4-А'; T = 'Ф5-А'; T = 'Ф6-А'; T = 'ФП5-А'; T = 'ФС1-А'; T = 'ФС2-А' ),
		P = 'высота'(3.4, 'м')
	);
	%----------------------------------------------------------------------------------------------------------------------------------------
	P = 'длина основания при вырывании'(PV, 'м'),
	(
		T = 'Ф1-А',	PV = 1.5;
		T = 'Ф2-А',	PV = 1.8;
		T = 'Ф3-А',	PV = 2.1;
		T = 'Ф4-А',	PV = 2.4;
		T = 'Ф5-А',	PV = 2.7;
		T = 'Ф6-А',	PV = 3.0;
		T = 'ФП5-А',	PV = 2.7;
		T = 'ФС1-А',	PV = 3.0;
		T = 'ФС2-А',	PV = 3.0
	);
	P = 'ширина основания при вырывании'(PV, 'м'),
	(
		T = 'Ф1-А',	PV = 1.5;
		T = 'Ф2-А',	PV = 1.8;
		T = 'Ф3-А',	PV = 2.1;
		T = 'Ф4-А',	PV = 2.4;
		T = 'Ф5-А',	PV = 2.7;
		T = 'Ф6-А',	PV = 2.02;
		T = 'ФП5-А',	PV = 2.7;
		T = 'ФС1-А',	PV = 4.8;
		T = 'ФС2-А',	PV = 5.2
	);
	P = 'длина основания при сжатии'(PV, 'м'),
	(
		T = 'Ф1-А',	PV = 1.5;
		T = 'Ф2-А',	PV = 1.8;
		T = 'Ф3-А',	PV = 2.1;
		T = 'Ф4-А',	PV = 2.4;
		T = 'Ф5-А',	PV = 2.7;
		T = 'Ф6-А',	PV = 3.0;
		T = 'ФП5-А',	PV = 2.7;
		T = 'ФС1-А',	PV = 3.0;
		T = 'ФС2-А',	PV = 3.0
	);
	P = 'ширина основания при сжатии'(PV, 'м'),
	(
		T = 'Ф1-А',	PV = 1.5;
		T = 'Ф2-А',	PV = 1.8;
		T = 'Ф3-А',	PV = 2.1;
		T = 'Ф4-А',	PV = 2.4;
		T = 'Ф5-А',	PV = 2.7;
		T = 'Ф6-А',	PV = 2.02;
		T = 'ФП5-А',	PV = 2.7;
		T = 'ФС1-А',	PV = 2.02;
		T = 'ФС2-А',	PV = 2.02
	);
	P = 'объем железобетона'(PV, 'м^3'),
	(
		T = 'Ф1-А',	PV = 1.0;
		T = 'Ф2-А',	PV = 1.2;
		T = 'Ф3-А',	PV = 1.7;
		T = 'Ф4-А',	PV = 2.0;
		T = 'Ф5-А',	PV = 2.5;
		T = 'Ф6-А',	PV = 2.7;
		T = 'ФП5-А',	PV = 3.0;
		T = 'ФС1-А',	PV = 4.22;
		T = 'ФС2-А',	PV = 4.64
	);
	P = 'вес элемента без подкладной плиты'(PV, 'т'),
	(
		T = 'Ф1-А',	PV = 2.5;
		T = 'Ф2-А',	PV = 3.0;
		T = 'Ф3-А',	PV = 4.37;
		T = 'Ф4-А',	PV = 5.0;
		T = 'Ф5-А',	PV = 6.5;
		T = 'Ф6-А',	PV = 6.8;
		T = 'ФП5-А',	PV = 7.5;
		T = 'ФС1-А',	PV = 10.6;
		T = 'ФС2-А',	PV = 11.6
	).

'допустимый фундамент для опоры'('тип'('анкерно-угловая'), T):-
	T = 'Ф1-А'; T = 'Ф2-А'; T = 'Ф3-А'; T = 'Ф4-А'; T = 'Ф5-А'; T = 'Ф6-А'; T = 'ФП5-А'; T = 'ФС1-А'; T = 'ФС2-А', !.



%'допустимый фундамент для опоры'('тип'(_), T):- 

/*
'вес_подкладной_плиты'('значение'(3.25), 'единица_измерения'('т')).

'вывести_на_консоль'(Тип, Марка, Н, ТМО, П):-
	nl, nl, write('фундамент типа  '), write(Тип), write('  | марки '), write(Марка), write('  | из номенклатуры '), write(Н), write('  | для опор типа '), writeln(ТМО), 
		write('\t\t\t имеют параметр    '), writeln(П), !.
	

test:-
	writeln(run_test),
	forall('фундамент'('тип_металлической_опоры'(ТМО), 'номенклатура'(Н), 'тип'(Тип, 'марка'(Марка)), 'параметр'(П)), 'вывести_на_консоль'(Тип, Марка, Н, ТМО, П)),
	true.
*/
